In [2]:
import numpy as np
import pandas as pd

In [3]:
dict = {'Company':['COM1', 'COM1', 'COM2','COM2','COM3','COM3'], 
        'Months':['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN'],
       'Salary': [2000, 1500, 3000, 5000, 2500, 3500]}

In [4]:
df = pd.DataFrame(dict)

In [5]:
df

  Company Months  Salary
0    COM1    JAN    2000
1    COM1    FEB    1500
2    COM2    MAR    3000
3    COM2    APR    5000
4    COM3    MAY    2500
5    COM3    JUN    3500

In [10]:
df.groupby('Company').mean()

         Salary
Company
COM1       1750
COM2       4000
COM3       3000

In [11]:
df.groupby('Company').sum()

         Salary
Company
COM1       3500
COM2       8000
COM3       6000

In [12]:
df.groupby('Company').mean().loc['COM3']

Salary    3000
Name: COM3, dtype: int64

In [13]:
df.groupby('Company').count()

         Months  Salary
Company
COM1          2       2
COM2          2       2
COM3          2       2

In [14]:
df.groupby('Company').describe()

        Salary
         count    mean          std     min     25%     50%     75%     max
Company
COM1       2.0  1750.0   353.553391  1500.0  1625.0  1750.0  1875.0  2000.0
COM2       2.0  4000.0  1414.213562  3000.0  3500.0  4000.0  4500.0  5000.0
COM3       2.0  3000.0   707.106781  2500.0  2750.0  3000.0  3250.0  3500.0

In [15]:
df.groupby('Company').describe().transpose()

Company              COM1         COM2         COM3
Salary count     2.000000     2.000000     2.000000
       mean   1750.000000  4000.000000  3000.000000
       std     353.553391  1414.213562   707.106781
       min    1500.000000  3000.000000  2500.000000
       25%    1625.000000  3500.000000  2750.000000
       50%    1750.000000  4000.000000  3000.000000
       75%    1875.000000  4500.000000  3250.000000
       max    2000.000000  5000.000000  3500.000000

In [16]:
df.groupby('Company').describe().transpose()['COM3']

Salary  count       2.000000
        mean     3000.000000
        std       707.106781
        min      2500.000000
        25%      2750.000000
        50%      3000.000000
        75%      3250.000000
        max      3500.000000
Name: COM3, dtype: float64

In [17]:
com_3 = df.groupby('Company').describe().transpose()['COM3']

In [18]:
type(com_3)

pandas.core.series.Series

In [19]:
com_3

Salary  count       2.000000
        mean     3000.000000
        std       707.106781
        min      2500.000000
        25%      2750.000000
        50%      3000.000000
        75%      3250.000000
        max      3500.000000
Name: COM3, dtype: float64